<?php

namespace Modules\Core\Services;


class TranslitServices
{
    public $array=[
        //default
        'default'=>[
            "а"=>"a","А"=>"A",
            "б"=>"b","Б"=>"B",
            "в"=>"v","В"=>"V",
            "г"=>"g","Г"=>"G",
            "д"=>"d","Д"=>"D",
            "е"=>"e","Е"=>"E",
            "ё"=>"e","Ё"=>"E",
            "ж"=>"j","Ж"=>"J",
            "з"=>"z","З"=>"Z",
            "и"=>"i","И"=>"I",
            "й"=>"y","Й"=>"Y",
            "к"=>"k","К"=>"K",
            "л"=>"l","Л"=>"L",
            "м"=>"m","М"=>"M",
            "н"=>"n","Н"=>"N",
            "о"=>"o","О"=>"O",
            "п"=>"p","П"=>"P",
            "р"=>"r","Р"=>"R",
            "с"=>"s","С"=>"S",
            "т"=>"t","Т"=>"T",
            "у"=>"u","У"=>"U",
            "ф"=>"f","Ф"=>"F",
            "х"=>"h","Х"=>"H",
            "ц"=>"ts","Ц"=>"Ts",
            "ч"=>"ch","Ч"=>"Ch",
            "ш"=>"sh","Ш"=>"Sh",
            "щ"=>"sch","Щ"=>"Sch",
            "ъ"=>"y","Ъ"=>"",
            "ы"=>"yi","Ы"=>"Yi",
            "ь"=>'',"Ь"=>'',
            "э"=>"e","Э"=>"E",
            "ю"=>"yu","Ю"=>"Yu",
            "я"=>"ya","Я"=>"Ya",
            '+'=>'plus','='=>'ravno'
        ],
        'en'=>[
            "a"=>"a","A"=>"A",
            "b"=>"b","B"=>"B",
            "c"=>"c","C"=>"C",
            "d"=>"d","D"=>"D",
            "e"=>"e","E"=>"E",
            "f"=>"f","F"=>"F",
            "g"=>"g","G"=>"G",
            "h"=>"h","H"=>"H",
            "i"=>"i","I"=>"I",
            "j"=>"j","J"=>"J",
            "k"=>"k","K"=>"K",
            "l"=>"l","L"=>"L",
            "m"=>"m","M"=>"M",
            "n"=>"n","N"=>"N",
            "o"=>"o","O"=>"O",
            "p"=>"p","P"=>"P",
            "q"=>"q","Q"=>"Q",
            "r"=>"r","R"=>"R",
            "s"=>"s","S"=>"S",
            "t"=>"t","T"=>"T",
            "u"=>"u","U"=>"U",
            "w"=>"w","W"=>"W",
            "v"=>"v","V"=>"V",
            "x"=>"x","X"=>"X",
            "y"=>"y","Y"=>"Y",
            "z"=>"z","Z"=>"Z"
        ],
        'uk'=>[
            "а"=>"a","А"=>"A",
            "б"=>"b","Б"=>"B",
            "в	"=>"v","В"=>"V",
            "г"=>"g","Г"=>"G",
            "ґ"=>"g","Ґ"=>"G",
            "д"=>"d","Д"=>"D",
            "е"=>"e","Е"=>"E",
            "є"=>"e","Є"=>"E",
            "ж"=>"j","Ж"=>"J",
            "з"=>"z","З"=>"Z",
            "и"=>"i","И"=>"I",
            "і"=>"i","І"=>"I",
            "ї"=>"y","Ї"=>"Y",
            "й"=>"y","Й"=>"Y",
            "к"=>"k","К"=>"K",
            "л"=>"l","Л"=>"L",
            "м"=>"m","М"=>"M",
            "н"=>"n","Н"=>"N",
            "о"=>"o","О"=>"O",
            "п"=>"p","П"=>"P",
            "р"=>"r","Р"=>"R",
            "с"=>"s","С"=>"S",
            "т"=>"t","Т"=>"T",
            "у"=>"u","У"=>"U",
            "ф"=>"f","Ф"=>"F",
            "х"=>"h","Х"=>"H",
            "ц"=>"ts","Ц"=>"Ts",
            "ч"=>"ch","Ч"=>"Ch",
            "ш"=>"sh","Ш"=>"Sh",
            "щ"=>"sch","Щ"=>"Sch",
            "ь"=>'',"Ь"=>'',
            "ю"=>"e","Ю"=>"Yu",
            "я"=>"ya","Я"=>"Ya",
        ],
        //url
        'url'=>[
            " "=>'-',
            ','=>'','.'=>'',
            '`'=>'',"'"=>'',
            '"'=>'','_'=>'',
            '/'=>'','\\'=>'',
            '<'=>'','>'=>'',
            '!'=>'','?'=>'',
            '|'=>'','”'=>'',
            '{'=>'','}'=>'',
            '('=>'',')'=>'',
            '^'=>'','#'=>'',
            '@'=>'','%'=>'',
            '*'=>'','№'=>'',
            '«'=>'','»'=>'',
            ':'=>'',';'=>'',
            '“'=>'','«'=>'',
            '»'=>'','+'=>'plus',
            '='=>'ravno'
        ]
    ];
    //Преобразование строки в траслит
    public function toString($string){
        return strtr($string,$this->array['default']);
    }
    //Преобразование строки по правилам url
    public function toUrl($string){
        return strtolower(strtr(strip_tags($string),array_merge(array_merge($this->array['default'], array_merge($this->array['en'], $this->array['uk'])),$this->array['url'])));
    }
}